publish/7.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-27 Fri 19:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Weekly#7</title>
<meta name="author" content="Spike Leung" />
<meta name="description" content="&quot;&quot;" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="../styles/style.css" type="text/css"/>
<link rel="icon" href="/favicon.ico" type="image/x-icon">
</head>
<body>
<div id="preamble" class="status">

 <nav>
  <ul>
    <li><a href="/index.html">Home</a></li>
    <li><a href="/about.html">About</a></li>
    <li><a href="/rss.xml">RSS</a></li>
    <li><a href="https://github.com/Spike-Leung/taxodium/tree/org-publish">GitHub</a></li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Weekly#7</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgab9e47f">News | Article</a>
<ul>
<li><a href="#org81f6d79">Six Things I Know For Sure About Marketing To Engineers</a></li>
<li><a href="#orgb98e36e">Opinions for Writing Good CSS</a></li>
<li><a href="#org5260bb7">Seafaring for Women in Software Engineering - Part I - Performance &amp; Promotion</a></li>
</ul>
</li>
<li><a href="#orgd940e2e">Tutorial</a>
<ul>
<li><a href="#org180a6b7">The Ultimate Guide to Font Performance Optimization | DebugBear</a></li>
<li><a href="#org8fa2976">A Complete Guide to Beginning with JavaScript – Frontend Masters Boost</a></li>
</ul>
</li>
<li><a href="#orgc3bb0eb">Code</a>
<ul>
<li><a href="#org652e362">Elastic Overflow Scrolling</a></li>
<li><a href="#org9e73540">Double your specificity with this one weird trick</a></li>
<li><a href="#orgb4d75ca">The web's clipboard, and how it stores data of different types</a></li>
<li><a href="#org72db38b">The Two Lines of CSS That Tanked Performance (120fps to 40fps)</a></li>
<li><a href="#orgd021a84">CSS-only infinite scrolling carousel animation</a></li>
</ul>
</li>
<li><a href="#org2b65447">Cool Bit</a>
<ul>
<li><a href="#orgeddc641">drwa me a comment</a></li>
<li><a href="#org285665f">Experience the Apollo 11 Lunar Landing</a></li>
<li><a href="#orga6e2171">PaddingLeft</a></li>
<li><a href="#org4979b68">Is My Blue Your Blue?</a></li>
<li><a href="#orgf27fe23">Button Stealer | Anatoly Zenkov</a></li>
</ul>
</li>
<li><a href="#orgc066a89">Tool | Library</a>
<ul>
<li><a href="#org7555662">PDFQFZ</a></li>
<li><a href="#orgb921bc0">logo surf</a></li>
<li><a href="#orgd18995e">Avatars - a list of free and fun avatars for your projects</a></li>
<li><a href="#org7d440cf">Reasonable Colors</a></li>
<li><a href="#orgc099ba9">@bramus/style-observer</a></li>
<li><a href="#org1469a43">Arc Browser</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgab9e47f" class="outline-2">
<h2 id="orgab9e47f">News | Article</h2>
<div class="outline-text-2" id="text-orgab9e47f">
</div>
<div id="outline-container-org81f6d79" class="outline-3">
<h3 id="org81f6d79"><a href="https://www.bly.com/Pages/documents/STIKFS.html">Six Things I Know For Sure About Marketing To Engineers</a></h3>
<div class="outline-text-3" id="text-org81f6d79">
<p>
关于向工程师营销时的六件事：
</p>

<ul class="org-ul">
<li>工程师的购买决策更注重逻辑而非情感</li>
<li>工程师希望了解功能和规格，而不仅仅是优点</li>
</ul>
</div>
</div>
<div id="outline-container-orgb98e36e" class="outline-3">
<h3 id="orgb98e36e"><a href="https://www.andrewwalpole.com/blog/opinions-for-writing-good-css/">Opinions for Writing Good CSS</a></h3>
<div class="outline-text-3" id="text-orgb98e36e">
<p>
编写优秀 CSS 的意见：
</p>

<ul class="org-ul">
<li>不要包含不需要的 CSS，不然久了就分不清是否需要</li>
<li>使用注释，说明一些特殊的 CSS，或者不知道为什么这面写的 CSS</li>
<li>避免 <code>!important</code></li>
<li>保持一致性，例如统一用 <a href="https://getbem.com/">BEM</a> 或 <a href="https://cube.fyi/">CUBE</a></li>
<li>充分利用 CSS 变量</li>
<li>提前考虑响应式设计，而不是在后面再添加，这样修改成本比较大</li>
<li>避免组件的外边距(margin)，和容器的内边距(padding), 推荐看看 <a href="https://kyleshevlin.com/no-outer-margin/">No Outer margin</a></li>
<li>避免复制粘贴别人的 CSS，尽量自己写，明白每一个 CSS 定义的含义和作用</li>
</ul>
</div>
</div>
<div id="outline-container-org5260bb7" class="outline-3">
<h3 id="org5260bb7"><a href="https://beabytes.com/seafaring-part-i/">Seafaring for Women in Software Engineering - Part I - Performance &amp; Promotion</a></h3>
<div class="outline-text-3" id="text-org5260bb7">
<p>
想要什么需要说出来，自己去争取。
</p>

<blockquote>
<p>
公司是希望以你愿意接受的最低金额雇用你，除非你提出要求，否则晋升或加薪并不符合他们的利益。
</p>
</blockquote>

<blockquote>
<p>
My best career advice:
</p>

<p>
At every job you should either learn or earn.Either is fine.Both is best.
Bust if it's neither, quit.
</p>

<p>
在每份工作中，你要么学习，要么赚钱。两者任何一个都可以，最好是两者兼得。
如果两者都没有，那就辞职。
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-orgd940e2e" class="outline-2">
<h2 id="orgd940e2e">Tutorial</h2>
<div class="outline-text-2" id="text-orgd940e2e">
</div>
<div id="outline-container-org180a6b7" class="outline-3">
<h3 id="org180a6b7"><a href="https://www.debugbear.com/blog/website-font-performance">The Ultimate Guide to Font Performance Optimization | DebugBear</a></h3>
<div class="outline-text-3" id="text-org180a6b7">
<p>
字体优化的教程，通过优化字体提高页面性能。
</p>
</div>
</div>
<div id="outline-container-org8fa2976" class="outline-3">
<h3 id="org8fa2976"><a href="https://frontendmasters.com/blog/a-complete-guide-to-beginning-with-javascript/">A Complete Guide to Beginning with JavaScript – Frontend Masters Boost</a></h3>
<div class="outline-text-3" id="text-org8fa2976">
<p>
学习 JavaScript 之前的一些预备知识，扫除入门 JavaScript 的一些障碍，并提供了相关的学习资源。
</p>
</div>
</div>
</div>
<div id="outline-container-orgc3bb0eb" class="outline-2">
<h2 id="orgc3bb0eb">Code</h2>
<div class="outline-text-2" id="text-orgc3bb0eb">
</div>
<div id="outline-container-org652e362" class="outline-3">
<h3 id="org652e362"><a href="https://css-tricks.com/elastic-overflow-scrolling/">Elastic Overflow Scrolling</a></h3>
<div class="outline-text-3" id="text-org652e362">
<p>
CSS 模仿手机上拉下拉的回弹效果。
</p>
</div>
</div>
<div id="outline-container-org9e73540" class="outline-3">
<h3 id="org9e73540"><a href="https://cirrus.twiddles.com/blog/2024/08/21/double-your-specificity-with-this-one-weird-trick/">Double your specificity with this one weird trick</a></h3>
<div class="outline-text-3" id="text-org9e73540">
<p>
写 CSS 的时候，需要增加某个选择器的权重，可以重复相同的类名去增加权重。
</p>

<p>
这样可以避免 <code>!important</code> ， 避免一些多余的类名，同时重复的类名也可以看出选择器被故意增加了权重。
</p>

<p>
关于 CSS 权重，推荐看看 <a href="https://www.bram.us/2024/05/05/misconceptions-about-css-specificity">Misconceptions about CSS Specificity</a> 。
</p>
</div>
</div>
<div id="outline-container-orgb4d75ca" class="outline-3">
<h3 id="orgb4d75ca"><a href="https://alexharri.com/blog/clipboard">The web's clipboard, and how it stores data of different types</a></h3>
<div class="outline-text-3" id="text-orgb4d75ca">
<p>
文章介绍了浏览器粘贴板是如何存储不同类型数据的。
</p>
</div>
</div>
<div id="outline-container-org72db38b" class="outline-3">
<h3 id="org72db38b"><a href="https://component-odyssey.com/articles/13-improving-performance-by-changing-two-lines-of-css">The Two Lines of CSS That Tanked Performance (120fps to 40fps)</a></h3>
<div class="outline-text-3" id="text-org72db38b">
<p>
降低性能的两行 CSS（从 120fps 降至 40 fps)。
</p>

<p>
排查性能问题先要了解页面的渲染过程（布局 Layout -&gt; 绘制 Paint -&gt; 组合 Composite），然后去分析每个过程的时间，找到出现问题的地方。
</p>
</div>
</div>
<div id="outline-container-orgd021a84" class="outline-3">
<h3 id="orgd021a84"><a href="https://blog.logto.io/css-only-infinite-scroll">CSS-only infinite scrolling carousel animation</a></h3>
<div class="outline-text-3" id="text-orgd021a84">
<p>
纯 CSS 实现轮播图。
</p>
</div>
</div>
</div>
<div id="outline-container-org2b65447" class="outline-2">
<h2 id="org2b65447">Cool Bit</h2>
<div class="outline-text-2" id="text-org2b65447">
</div>
<div id="outline-container-orgeddc641" class="outline-3">
<h3 id="orgeddc641"><a href="https://danq.me/2024/08/15/draw-me-a-comment/">drwa me a comment</a></h3>
<div class="outline-text-3" id="text-orgeddc641">
<p>
通过绘画留言，挺有趣的。
</p>
</div>
</div>
<div id="outline-container-org285665f" class="outline-3">
<h3 id="org285665f"><a href="https://www.firstmenonthemoon.com/">Experience the Apollo 11 Lunar Landing</a></h3>
<div class="outline-text-3" id="text-org285665f">
<p>
体验 Apollo 11 月球登录的过程。
</p>
</div>
</div>
<div id="outline-container-orga6e2171" class="outline-3">
<h3 id="orga6e2171"><a href="https://padding-left.com/">PaddingLeft</a></h3>
<div class="outline-text-3" id="text-orga6e2171">
<p>
一个淘宝商店，可以购买一些贴纸，卖出的贴纸会为对应的开源项目捐赠 1 元。
</p>
</div>
</div>
<div id="outline-container-org4979b68" class="outline-3">
<h3 id="org4979b68"><a href="https://ismy.blue/">Is My Blue Your Blue?</a></h3>
<div class="outline-text-3" id="text-org4979b68">
<p>
通过几次选择，判断你对绿色和蓝色的分辨程度，在蓝色和绿色之间的一些颜色，确实有点分不清。
</p>
</div>
</div>
<div id="outline-container-orgf27fe23" class="outline-3">
<h3 id="orgf27fe23"><a href="https://anatolyzenkov.com/stolen-buttons/button-stealer">Button Stealer | Anatoly Zenkov</a></h3>
<div class="outline-text-3" id="text-orgf27fe23">
<p>
一个 Chrome 插件，可以“偷”你访问的网页的按钮，一段时间后可以看看自己都“偷”了什么按钮。
</p>
</div>
</div>
</div>
<div id="outline-container-orgc066a89" class="outline-2">
<h2 id="orgc066a89">Tool | Library</h2>
<div class="outline-text-2" id="text-orgc066a89">
</div>
<div id="outline-container-org7555662" class="outline-3">
<h3 id="org7555662"><a href="https://github.com/flytkgl/PDFQFZ">PDFQFZ</a></h3>
<div class="outline-text-3" id="text-org7555662">
<p>
PDF 加盖<a href="https://www.wikiwand.com/zh/articles/%E9%AA%91%E7%BC%9D%E7%AB%A0">骑缝章</a>的小工具。
</p>
</div>
</div>
<div id="outline-container-orgb921bc0" class="outline-3">
<h3 id="orgb921bc0"><a href="https://www.logo.surf/#generate-favicon">logo surf</a></h3>
<div class="outline-text-3" id="text-orgb921bc0">
<p>
logo 创建小工具。
</p>
</div>
</div>
<div id="outline-container-orgd18995e" class="outline-3">
<h3 id="orgd18995e"><a href="https://alohe.github.io/avatars/">Avatars - a list of free and fun avatars for your projects</a></h3>
<div class="outline-text-3" id="text-orgd18995e">
<p>
一组免费的头像，可以用来作为系统的头像库。
</p>
</div>
</div>
<div id="outline-container-org7d440cf" class="outline-3">
<h3 id="org7d440cf"><a href="https://www.reasonable.work/colors/">Reasonable Colors</a></h3>
<div class="outline-text-3" id="text-org7d440cf">
<p>
一些颜色面板，具有高对比度，符合 <a href="https://www.w3.org/TR/WCAG21/#contrast-minimum">Web Content Accessibility Guidelines (WCAG) 2.1</a> 推荐对比度。
</p>
</div>
</div>
<div id="outline-container-orgc099ba9" class="outline-3">
<h3 id="orgc099ba9"><a href="https://www.bram.us/2024/08/31/introducing-bramus-style-observer-a-mutationobserver-for-css/">@bramus/style-observer</a></h3>
<div class="outline-text-3" id="text-orgc099ba9">
<p>
可以监听 CSS 的变化的库，不过浏览器支持要求版本比较高。
</p>
</div>
</div>
<div id="outline-container-org1469a43" class="outline-3">
<h3 id="org1469a43"><a href="https://arc.net/">Arc Browser</a></h3>
<div class="outline-text-3" id="text-org1469a43">
<p>
最近将浏览器换成了 Arc 浏览器，它是基于 Chrome 内核的，原来的插件，页面的调试都没有什么影响。
</p>

<p>
喜欢它的点是：
</p>

<ul class="org-ul">
<li>页面简洁，可以隐藏侧边栏</li>
<li>新增页面，切换页面地址栏的快捷键好用</li>
<li>浏览器内可以分屏看多个网页</li>
<li>页面 pin 比较好用</li>
<li>临时页面会打开一个 peak 小窗口，方便</li>
</ul>

<p>
缺点是在 windows 上似乎需要开启 tun 模式才能正常打开，对网络有一些要求。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

<p class="author">Author: <a href="mailto:l-yanlei@hotmail.com">Spike Leung</a></p>
<p class="date">Date: 2024-09-08 Sun 00:00</p>
<p class="license">License: <a href="https://www.creativecommons.org/licenses/by-nc/4.0/deed.zh-hans">CC BY-NC 4.0</a></p>
<script src="https://utteranc.es/client.js" repo="Spike-Leung/taxodium" issue-term="pathname" theme="github-light" crossorigin="anonymous" async></script>
</div>
</body>
</html>
